[
  {
    "id": 1,
    "title": "All Quiet on the Western Front",
    "year": 2022,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/All Quiet on the Western Front 2022-thumbnail.jpg",
    "poster": "/covers/posters/All Quiet on the Western Front 2022-poster.jpg",
    "description": "All Quiet on the Western Front (German: Im Westen nichts Neues, lit. 'Nothing New in the West') is a 2022 German epic anti-war film based on the 1929 novel by Erich Maria Remarque. It is the third film adaptation of the book, after the 1930 and 1979 versions. Co-written, directed and co-produced by Edward Berger, it stars Felix Kammerer, Albrecht Schuch, Daniel Brühl, Sebastian Hülk, Aaron Hilmer, Edin Hasanovic, and Devid Striesow.",
    "type": "movie"
  },
  {
    "id": 2,
    "title": "Inception",
    "year": 2010,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Inception-2010-thumbnail.jpg",
    "poster": "/covers/posters/Inception-2010-poster.jpg",
    "description": "Inception is a 2010 science fiction action heist film written and directed by Christopher Nolan, who also produced it with Emma Thomas, his wife. The film stars Leonardo DiCaprio as a professional thief who steals information by infiltrating the subconscious of his targets. He is offered a chance to have his criminal history erased as payment for the implantation of another person's idea into a target's subconscious. The ensemble cast includes Ken Watanabe, Joseph Gordon-Levitt, Marion Cotillard, Elliot Page,[a] Tom Hardy, Cillian Murphy, Tom Berenger, Dileep Rao, and Michael Caine.",
    "type": "movie"
  },
  {
    "id": 3,
    "title": "Terminator: Dark Fate",
    "year": 2019,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Terminator Dark Fate-thumbnail.jpg",
    "poster": "/covers/posters/Terminator Dark Fate-poster.jpg",
    "description": "Terminator: Dark Fate is a 2019 American science fiction action film directed by Tim Miller and written by David S. Goyer, Justin Rhodes, and Billy Ray. It is the sixth film in the Terminator franchise and a direct sequel to Terminator 2: Judgment Day (1991), ignoring the events of the intervening sequels.",
    "type": "movie"
  },
  {
    "id": 4,
    "title": "Spider-Man 2",
    "year": 2004,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/Spider-Man 2-thumbnail.webp",
    "poster": "/covers/posters/Spider-Man 2-poster.webp",
    "description": "Spider-Man 2 is a 2004 American superhero film based on the Marvel Comics character Spider-Man. Directed by Sam Raimi and written by Alvin Sargent from a story conceived by Michael Chabon and the writing team of Alfred Gough and Miles Millar, the film was produced by Columbia Pictures in association with Marvel Enterprises and Laura Ziskin Productions, and distributed by Sony Pictures Releasing. It is the second installment in Raimi's Spider-Man trilogy and the sequel to Spider-Man (2002). The film stars Tobey Maguire as Peter Parker / Spider-Man, alongside Kirsten Dunst, James Franco, Alfred Molina, Rosemary Harris, and Donna Murphy. Peter Parker fights to stop scientist Dr. Otto Octavius from recreating a dangerous experiment, while also dealing with a personal crisis.",
    "type": "movie"
  },
  {
    "id": 5,
    "title": "Joker ",
    "year": 2019,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/Joker-thumbnail.jpg",
    "poster": "/covers/posters/Joker-poster.jpg",
    "description": "Joker is a 2019 American psychological thriller film directed by Todd Phillips from a screenplay he co-wrote with Scott Silver. Based on DC Comics characters, it stars Joaquin Phoenix and provides an alternative origin story for the Joker. The film follows Arthur Fleck, a struggling clown and aspiring stand-up comedian whose descent into mental illness and nihilism inspires a violent countercultural revolution against the wealthy in a decaying Gotham City. Robert De Niro, Zazie Beetz, and Frances Conroy appear in supporting roles. Distributed by Warner Bros. Pictures, Joker was produced by Warner Bros. Pictures and DC Films in association with Village Roadshow Pictures, Bron Creative and Joint Effort.",
    "type": "movie"
  },
  {
    "id": 6,
    "title": "Pirates of the Caribbean: Dead Men Tell No Tales",
    "year": 2017,
    "genre": "Fantasy",
    "thumbnail": "/covers/thumbnails/Pirates of the Caribbean Dead Men Tell No Tales-thumbnail.webp",
    "poster": "/covers/posters/Pirates of the Caribbean Dead Men Tell No Tales-poster.webp",
    "description": "Pirates of the Caribbean: Dead Men Tell No Tales (released in some territories as Pirates of the Caribbean: Salazar's Revenge) is a 2017 American swashbuckler fantasy film directed by Joachim Rønning and Espen Sandberg, and written by Jeff Nathanson. It is the fifth film in the Pirates of the Caribbean film series and stars an ensemble cast including Johnny Depp, Javier Bardem, Geoffrey Rush, Brenton Thwaites, Kaya Scodelario, and Kevin McNally. Its story follows a search for the Trident of Poseidon by a down-on-his-luck Captain Jack Sparrow pursued by Captain Armando Salazar and a crew of deadly ghosts who have escaped from the Devil's Triangle, determined to kill every pirate at sea and take revenge on Sparrow.",
    "type": "movie"
  },
  {
    "id": 7,
    "title": "2 Fast 2 Furious",
    "year": 2003,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/2 Fast 2 Furious-thumbnail.webp",
    "poster": "/covers/posters/2 Fast 2 Furious-poster.webp",
    "description": "2 Fast 2 Furious is a 2003 action film directed by John Singleton from a screenplay by Michael Brandt and Derek Haas, based on a story by Brandt, Haas, and Gary Scott Thompson. It is the sequel to The Fast and the Furious (2001) and the second installment in the Fast & Furious franchise. The film stars Paul Walker as Brian O'Conner alongside Tyrese Gibson, Eva Mendes, Cole Hauser, Chris Ludacris Bridges, and James Remar. The plot follows ex-LAPD officer Brian O'Conner and his ex-con friend Roman Pearce, who transport a shipment of dirty money for shady Miami-based import-export dealer Carter Verone while secretly working with undercover agent Monica Fuentes to bring Verone down.",
    "type": "movie"
  },
  {
    "id": 8,
    "title": "Deadpool 2",
    "year": 2018,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Deadpool-2-thumbnail.webp",
    "poster": "/covers/posters/Deadpool-2-poster.webp",
    "description": "Deadpool 2 is a 2018 American superhero film based on the Marvel Comics character Deadpool. It is the sequel to Deadpool (2016) and the eleventh installment in the X-Men film series. The film was directed by David Leitch and written by Rhett Reese, Paul Wernick, and Ryan Reynolds, who stars in the title role alongside Josh Brolin, Morena Baccarin, Julian Dennison, Zazie Beetz, T.J. Miller, Brianna Hildebrand, and Jack Kesy. In the film, Deadpool forms the X-Force to protect a young mutant from the time-traveling soldier Cable.",
    "type": "movie"
  },
  {
    "id": 9,
    "title": "Extraction ",
    "year": 2020,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Extraction-thumbnail.jpg",
    "poster": "/covers/posters/Extraction-poster.jpg",
    "description": "Extraction is a 2020 American action thriller film directed by Sam Hargrave and written by Joe Russo, based on the 2014 graphic novel Ciudad. The film stars Chris Hemsworth, Rudhraksh Jaiswal, Randeep Hooda, Golshifteh Farahani, Pankaj Tripathi and David Harbour. In the film, an Australian black ops mercenary takes on a mission to save an Indian drug lord's kidnapped son in Dhaka, Bangladesh, but the mission goes awry when he is double-crossed.",
    "type": "movie"
  },
  {
    "id": 10,
    "title": "Dune: Part Two",
    "year": 2024,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/Dune-Part Two-thumbnail.jpg",
    "poster": "/covers/posters/Dune-Part Two-poster.jpg",
    "description": "Dune: Part Two is a 2024 American epic space opera film directed by Denis Villeneuve, who co-wrote the screenplay with Jon Spaihts. The sequel to Dune (2021), it is the second of a two-part adaptation of the 1965 novel Dune by Frank Herbert, and the second installment of Villeneuve's Dune film trilogy. It follows Paul Atreides as he unites with the Fremen people of the desert planet Arrakis to wage war against House Harkonnen. Timothée Chalamet, Zendaya, Rebecca Ferguson, Josh Brolin, Stellan Skarsgård, Dave Bautista, Charlotte Rampling, and Javier Bardem reprise their roles from the first film, with Austin Butler, Florence Pugh, Christopher Walken, and Léa Seydoux joining the cast.",
    "type": "movie"
  },
  {
    "id": 11,
    "title": "Harry Potter and the Deathly Hallows: Part 2",
    "year": 2011,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/Harry Potter and the Deathly Hallows Part 2-thumbnail.jpg",
    "poster": "/covers/posters/Harry Potter and the Deathly Hallows Part 2-poster.jpg",
    "description": "Harry Potter and the Deathly Hallows – Part 2 is a 2011 fantasy film directed by David Yates from a screenplay by Steve Kloves.[4] The film is the second of two cinematic parts based on the 2007 novel by J. K. Rowling and the eighth and final instalment of the Harry Potter film series",
    "type": "movie"
  },
  {
    "id": 12,
    "title": "Spider-Man: Far from Home",
    "year": 2019,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/Spider-Man Far from Home-thumbnail.jpg",
    "poster": "/covers/posters/Spider-Man Far from Home-poster.jpg",
    "description": "Spider-Man: Far From Home is a 2019 American superhero film based on the Marvel Comics character Spider-Man, co-produced by Columbia Pictures and Marvel Studios, and distributed by Sony Pictures Releasing. It is the sequel to Spider-Man: Homecoming (2017) and the 23rd film in the Marvel Cinematic Universe (MCU). The film was directed by Jon Watts, written by Chris McKenna and Erik Sommers, and stars Tom Holland as Peter Parker / Spider-Man, alongside Samuel L. Jackson, Zendaya, Cobie Smulders, Jon Favreau, J. B. Smoove, Jacob Batalon, Martin Starr, Tony Revolori, Marisa Tomei, and Jake Gyllenhaal. In the film, Parker is recruited by Nick Fury (Jackson) and Mysterio (Gyllenhaal) to face the Elementals while he is on a school trip to Europe",
    "type": "movie"
  },
  {
    "id": 13,
    "title": "Fury ",
    "year": 2014,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Fury-thumbnail.jpg",
    "poster": "/covers/posters/Fury-poster.jpg",
    "description": "Fury is a 2014 American war film written, directed, and co-produced by David Ayer. It stars Brad Pitt with Shia LaBeouf, Logan Lerman, Michael Peña, and Jon Bernthal as members of an American tank crew fighting in Nazi Germany during the final weeks of the European theater of World War II. Ayer was influenced by the service of military veterans in his family and by reading books such as Belton Y. Cooper's Death Traps, a 1998 memoir that underscores the high casualty rates suffered by American tank crews in combat against their better-equipped German counterparts.",
    "type": "movie"
  },
  {
    "id": 14,
    "title": "Harry Potter and the Chamber of Secrets",
    "year": 2002,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/Harry Potter and the Chamber of Secrets-thumbnail.jpg",
    "poster": "/covers/posters/Harry Potter and the Chamber of Secrets-poster.jpg",
    "description": "Harry Potter and the Chamber of Secrets is a 2002 fantasy film directed by Chris Columbus from a screenplay by Steve Kloves. It is based on the 1998 novel Harry Potter and the Chamber of Secrets by J. K. Rowling. Produced by David Heyman, it is the sequel to Harry Potter and the Philosopher's Stone (2001) and the second instalment in the Harry Potter film series. The film stars Daniel Radcliffe as Harry Potter, with Rupert Grint and Emma Watson as his best friends Ron Weasley and Hermione Granger respectively. The story follows Harry's second year at Hogwarts School of Witchcraft and Wizardry, where the Heir of Salazar Slytherin opens the Chamber of Secrets, unleashing a monster that petrifies the school's students.",
    "type": "movie"
  },
  {
    "id": 15,
    "title": "Undisputed II: Last Man Standing",
    "year": 2006,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Undisputed II Last Man Standing-thumbnail.jpg",
    "poster": "/covers/posters/Undisputed II Last Man Standing-poster.jpg",
    "description": "Undisputed II: Last Man Standing is a 2006 American direct-to-video martial arts action film directed by Isaac Florentine and starring Michael Jai White, Scott Adkins, Eli Danker and Ben Cross. It is the sequel to the boxing movie Undisputed (2002), and the second installment in the Undisputed franchise. White portrays ex-boxer George Iceman Chambers, a role originally played by Ving Rhames in the first film. It was followed by two sequels: Undisputed III: Redemption (2010) and Boyka: Undisputed (2017), which continues the story of Russian prison fighter Yuri Boyka, played by Adkins.",
    "type": "movie"
  },
  {
    "id": 16,
    "title": "Pirates of the Caribbean: On Stranger Tides",
    "year": 2011,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/Pirates of the Caribbean On Stranger Tides-thumbnail.jpg",
    "poster": "/covers/posters/Pirates of the Caribbean On Stranger Tides-poster.jpg",
    "description": "Pirates of the Caribbean: On Stranger Tides is a 2011 American fantasy swashbuckler film directed by Rob Marshall, produced by Jerry Bruckheimer, and written by Ted Elliott and Terry Rossio, loosely based on the 1987 novel On Stranger Tides by Tim Powers. It is the fourth film in the Pirates of the Caribbean film series. Johnny Depp, Kevin R. McNally and Geoffrey Rush reprise their roles from the previous films, with Penélope Cruz and Ian McShane joining the cast. The story follows the eccentric pirate Captain Jack Sparrow on a quest for the Fountain of Youth after crossing paths with Angelica, a mysterious woman from his past, and being forced aboard the Queen Anne's Revenge, the ship of the legendary pirate Blackbeard.",
    "type": "movie"
  },
  {
    "id": 17,
    "title": "F9",
    "year": 2021,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/F9-thumbnail.jpg",
    "poster": "/covers/posters/F9-poster.jpg",
    "description": "F9 (also known as F9: The Fast Saga or Fast & Furious 9) is a 2021 action film directed by Justin Lin, who co-wrote the screenplay with Daniel Casey.[7] It is the ninth installment and the sequel to The Fate of the Furious (2017) and Hobbs & Shaw (2019), and the overall tenth installment in the Fast & Furious franchise. It stars Vin Diesel as Dominic Dom Toretto, alongside Michelle Rodriguez, Tyrese Gibson, Chris Ludacris Bridges, John Cena, Nathalie Emmanuel, Jordana Brewster, Sung Kang, Michael Rooker, Helen Mirren, Kurt Russell, and Charlize Theron. In the film, Dom and his team aim to stop Otto, the son of a wealthy head of state, from activating Project Aries, a dangerous advanced weapons program.",
    "type": "movie"
  },
  {
    "id": 18,
    "title": "Wonder Park",
    "year": 2019,
    "genre": "Comedy",
    "thumbnail": "/covers/thumbnails/Wonder Park-thumbnail.jpg",
    "poster": "/covers/posters/Wonder Park-poster.jpg",
    "description": "Wonder Park is a 2019 animated adventure comedy film produced by Paramount Animation, Nickelodeon Movies, and Ilion Animation Studios handling animation. The plot follows a young girl who encounters a real version of her magical amusement park run by anthropomorphic animals. The film stars the voice talents of Jennifer Garner, Matthew Broderick, John Oliver, Mila Kunis, Kenan Thompson, Ken Jeong, Norbert Leo Butz, Brianna Denski in her film debut, and Ken Hudson Campbell.",
    "type": "movie"
  },
  {
    "id": 19,
    "title": "Pirates of the Caribbean: At World's End",
    "year": 2007,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/Pirates of the Caribbean At World's End-thumbnail.jpg",
    "poster": "/covers/posters/Pirates of the Caribbean At World's End-poster.jpg",
    "description": "Pirates of the Caribbean: At World's End is a 2007 American epic fantasy swashbuckler film directed by Gore Verbinski, produced by Jerry Bruckheimer, and written by Ted Elliott and Terry Rossio. The direct sequel to Pirates of the Caribbean: Dead Man's Chest (2006), it is the third installment in the Pirates of the Caribbean film series, and follows an urgent quest to locate and save Captain Jack Sparrow (Johnny Depp), trapped on a sea of sand in Davy Jones' Locker, and convene the Brethren Court in a war against the East India Trading Company. In an uneasy alliance, Will Turner (Orlando Bloom), Elizabeth Swann (Keira Knightley), Hector Barbossa (Geoffrey Rush), and the Black Pearl crew rescue Jack and prepare to fight Lord Cutler Beckett, who controls Davy Jones and the Flying Dutchman.",
    "type": "movie"
  },
  {
    "id": 20,
    "title": "Ant-Man",
    "year": 2015,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/Ant-Man-thumbnail.jpg",
    "poster": "/covers/posters/Ant-Man-poster.jpg",
    "description": "Ant-Man is a 2015 American superhero film based on the Marvel Comics characters of the same name: Scott Lang and Hank Pym. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the 12th film in the Marvel Cinematic Universe (MCU). The film was directed by Peyton Reed from a screenplay by the writing teams of Edgar Wright & Joe Cornish and Adam McKay & Paul Rudd. It stars Rudd as Scott Lang / Ant-Man alongside Evangeline Lilly, Corey Stoll, Bobby Cannavale, Michael Peña, Tip T.I. Harris, Anthony Mackie, Wood Harris, Judy Greer, Abby Ryder Fortson, David Dastmalchian, and Michael Douglas as Hank Pym. In the film, Lang must help defend Pym's Ant-Man shrinking technology and plot a heist with worldwide ramifications.",
    "type": "movie"
  },
  {
    "id": 21,
    "title": "Spider-Man: Into the Spider-Verse",
    "year": 2018,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/Spider-Man Into the Spider-Verse-thumbnail.jpg",
    "poster": "/covers/posters/Spider-Man Into the Spider-Verse-poster.jpg",
    "description": "Spider-Man: Into the Spider-Verse is a 2018 American animated superhero film based on the Marvel Comics character Spider-Man. Directed by Bob Persichetti, Peter Ramsey and Rodney Rothman from a screenplay by Phil Lord and Rothman, and starring Shameik Moore as Miles Morales, with Jake Johnson, Hailee Steinfeld, Mahershala Ali, Brian Tyree Henry, Lily Tomlin, Luna Lauren Vélez, John Mulaney, Kimiko Glenn, Nicolas Cage and Liev Schreiber in supporting roles, the film's story follows Miles as he becomes the new Spider-Man and joins other Spider-People from various parallel universes who team up to save his universe from the Kingpin. The first animated film in the Spider-Man franchise, it was produced by Columbia Pictures and Sony Pictures Animation in association with Marvel Entertainment.",
    "type": "movie"
  },
  {
    "id": 22,
    "title": "Avengers: Infinity War",
    "year": 2018,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Avengers Infinity War-thumbnail.jpg",
    "poster": "/covers/posters/Avengers Infinity War-poster.jpg",
    "description": "Avengers: Infinity War is a 2018 American superhero film based on the Marvel Comics superhero team the Avengers. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the sequel to The Avengers (2012) and Avengers: Age of Ultron (2015), and the 19th film in the Marvel Cinematic Universe (MCU). Directed by Anthony and Joe Russo and written by Christopher Markus and Stephen McFeely, the film features an ensemble cast including Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans, Scarlett Johansson, Benedict Cumberbatch, Don Cheadle, Tom Holland, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Anthony Mackie, Sebastian Stan, Danai Gurira, Letitia Wright, Dave Bautista, Zoe Saldaña, Josh Brolin, and Chris Pratt. In the film, the Avengers and the Guardians of the Galaxy attempt to stop Thanos from collecting the six powerful Infinity Stones as part of his quest to kill half of all life in the universe.",
    "type": "movie"
  },
  {
    "id": 23,
    "title": "The Fate of the Furious",
    "year": 2017,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/The Fate of the Furious-thumbnail.jpg",
    "poster": "/covers/posters/The Fate of the Furious-poster.jpg",
    "description": "The Fate of the Furious (also known as F8 or Fast & Furious 8) is a 2017 action film directed by F. Gary Gray and written by Chris Morgan. It is the sequel to Furious 7 (2015) and the eighth installment in the Fast & Furious franchise. The film stars Vin Diesel as Dominic Toretto, alongside Dwayne Johnson, Jason Statham, Michelle Rodriguez, Tyrese Gibson, Chris Ludacris Bridges, Scott Eastwood, Nathalie Emmanuel, Elsa Pataky, Kurt Russell, and Charlize Theron. In the film, Dom has settled down with his wife Letty Ortiz, until cyberterrorist Cipher (Theron) coerces him into working for her and turns him against his team, forcing them to find Dom and take down Cipher.",
    "type": "movie"
  },
  {
    "id": 24,
    "title": "Undisputed",
    "year": 2002,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Undisputed-thumbnail.jpg",
    "poster": "/covers/posters/Undisputed-poster.jpg",
    "description": "Undisputed is a 2002 American sports drama film written, produced and directed by Walter Hill. The film stars Wesley Snipes, Ving Rhames, Peter Falk, Michael Rooker, Jon Seda, Wes Studi, Fisher Stevens, and Master P.",
    "type": "movie"
  },
  {
    "id": 25,
    "title": "Undisputed III: Redemption",
    "year": 2010,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Undisputed III Redemption-thumbnail.jpg",
    "poster": "/covers/posters/Undisputed III Redemption-poster.jpg",
    "description": "Undisputed III: Redemption is a 2010 American martial arts action film directed by Isaac Florentine and starring Scott Adkins, Mykel Shannon Jenkins, Mark Ivanir and Hristo Shopov. It is the sequel to Undisputed II: Last Man Standing (2007), and the third installment overall in the Undisputed franchise. The movie's events take place several years chronologically after the events Last Man Standing.",
    "type": "movie"
  },
  {
    "id": 26,
    "title": "Rango",
    "year": 2011,
    "genre": "Comedy",
    "thumbnail": "/covers/thumbnails/Rango-thumbnail.jpg",
    "poster": "/covers/posters/Rango-poster.jpg",
    "description": "Rango is a 2011 American animated Western comedy film directed by Gore Verbinski and written by John Logan. The film stars Johnny Depp, with Isla Fisher, Abigail Breslin, Alfred Molina, Bill Nighy, Harry Dean Stanton, Ray Winstone and Timothy Olyphant in supporting roles. In the film, a pet chameleon ends up in the town of Dirt, an outpost that is in desperate need of a new sheriff.",
    "type": "movie"
  },
  {
    "id": 27,
    "title": "Avengers: Endgame",
    "year": 2019,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/Avengers Endgame-thumbnail.jpg",
    "poster": "/covers/posters/Avengers Endgame-poster.jpg",
    "description": "Avengers: Endgame is a 2019 American superhero film based on the Marvel Comics superhero team the Avengers. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the direct sequel to Avengers: Infinity War (2018) and the 22nd film in the Marvel Cinematic Universe (MCU). Directed by Anthony and Joe Russo and written by Christopher Markus and Stephen McFeely, the film features an ensemble cast which includes Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Don Cheadle, Paul Rudd, Brie Larson, Karen Gillan, Danai Gurira, Benedict Wong, Jon Favreau, Bradley Cooper, Gwyneth Paltrow, and Josh Brolin. In the film, the surviving members of the Avengers and their allies attempt to reverse Thanos's actions in Infinity War which erased half of all life in the universe.",
    "type": "movie"
  },
  {
    "id": 28,
    "title": "The Hobbit: An Unexpected Journey",
    "year": 2012,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/The Hobbit An Unexpected Journey-thumbnail.jpg",
    "poster": "/covers/posters/The Hobbit An Unexpected Journey-poster.jpg",
    "description": "The Hobbit: An Unexpected Journey is a 2012 epic high fantasy adventure film directed by Peter Jackson from a screenplay by Fran Walsh, Philippa Boyens, Jackson, and Guillermo del Toro. It is based on the 1937 novel The Hobbit by J. R. R. Tolkien. The Hobbit trilogy is a prequel to Jackson's The Lord of the Rings trilogy.",
    "type": "movie"
  },
  {
    "id": 29,
    "title": "Pirates of the Caribbean: Dead Man's Chest",
    "year": 2006,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/Pirates of the Caribbean Dead Man's Chest-thumbnail.jpg",
    "poster": "/covers/posters/Pirates of the Caribbean Dead Man's Chest-poster.jpg",
    "description": "Pirates of the Caribbean: Dead Man's Chest is a 2006 American fantasy swashbuckler film directed by Gore Verbinski, written by Ted Elliott and Terry Rossio, and produced by Jerry Bruckheimer. The sequel to Pirates of the Caribbean: The Curse of the Black Pearl (2003), it is the second installment in the Pirates of the Caribbean film series. It is set a year after the first film and follows Captain Jack Sparrow who owes a debt to Davy Jones (Bill Nighy), the ghastly captain of the Flying Dutchman, and being marked for death and pursued by the Kraken. Meanwhile, the wedding of Will Turner (Orlando Bloom) and Elizabeth Swann (Keira Knightley) is interrupted by Lord Cutler Beckett (Tom Hollander), who wants Turner to acquire Jack's magic compass in a bid to find the Dead Man's Chest",
    "type": "movie"
  },
  {
    "id": 30,
    "title": "Harry Potter and the Goblet of Fire",
    "year": 2005,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/Harry Potter and the Goblet of Fire-thumbnail.jpg",
    "poster": "/covers/posters/Harry Potter and the Goblet of Fire-poster.jpg",
    "description": "Harry Potter and the Goblet of Fire is a 2005 fantasy film directed by Mike Newell from a screenplay by Steve Kloves. It is based on the 2000 novel Harry Potter and the Goblet of Fire by J. K. Rowling. It is the sequel to Harry Potter and the Prisoner of Azkaban (2004) and the fourth instalment in the Harry Potter film series. The film stars Daniel Radcliffe as Harry Potter, alongside Rupert Grint and Emma Watson as Harry's best friends Ron Weasley and Hermione Granger, respectively. The story follows Harry's fourth year at Hogwarts, as he is chosen by the Goblet of Fire to compete in the Triwizard Tournament.",
    "type": "movie"
  },
  {
    "id": 31,
    "title": "Terminator 3: Rise of the Machines",
    "year": 2003,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Terminator 3 Rise of the Machines-thumbnail.jpg",
    "poster": "/covers/posters/Terminator 3 Rise of the Machines-poster.jpg",
    "description": "Terminator 3: Rise of the Machines[a] is a 2003 science fiction action film, the third installment in the Terminator franchise and a sequel to Terminator 2: Judgment Day (1991). It was directed by Jonathan Mostow and stars Arnold Schwarzenegger, Nick Stahl, Claire Danes, and Kristanna Loken. In its plot, the malevolent artificial intelligence Skynet sends a T-X (Loken)—a highly advanced Terminator—back in time to ensure the rise of machines by killing top members of the future human resistance as John Connor's (Stahl) location is unknown. The resistance sends back a reprogrammed T-850 (Schwarzenegger) to protect John and Kate (Danes).",
    "type": "movie"
  },
  {
    "id": 32,
    "title": "Taken 2",
    "year": 2012,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Taken 2-thumbnail.jpg",
    "poster": "/covers/posters/Taken 2-poster.jpg",
    "description": "Taken 2 is a 2012 French action-thriller film directed by Olivier Megaton and starring Liam Neeson, Maggie Grace, Famke Janssen, Rade Šerbedžija, Leland Orser, Jon Gries, D.B. Sweeney, and Luke Grimes. It follows retired CIA officer Bryan Mills as he ends up with his family in Istanbul, where he is kidnapped, along with his ex-wife, by the father of one of the men he killed while saving his daughter two years earlier.",
    "type": "movie"
  },
  {
    "id": 33,
    "title": "Fast & Furious 6",
    "year": 2013,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Fast & Furious 6-thumbnail.jpg",
    "poster": "/covers/posters/Fast & Furious 6-poster.jpg",
    "description": "Fast & Furious 6 (titled onscreen as Furious 6) is a 2013 action film directed by Justin Lin and written by Chris Morgan. It is the sequel to Fast Five (2011) and the sixth installment in the Fast & Furious franchise. The film stars Vin Diesel as Dominic Toretto and Paul Walker as Brian O'Conner, alongside Dwayne Johnson, Michelle Rodriguez, Jordana Brewster, Tyrese Gibson, Chris Ludacris Bridges, Sung Kang, Luke Evans, Gina Carano, and John Ortiz. In the film, Dom, Brian and their team are offered pardons for their crimes in exchange for helping DSS agent Luke Hobbs apprehend Owen Shaw (Evans), an ex-British SAS Major, who runs a mercenary organization in which Dom's former lover Letty is also a member.",
    "type": "movie"
  },
  {
    "id": 34,
    "title": "Avengers: Age of Ultron",
    "year": 2015,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/Avengers Age of Ultron-thumbnail.jpg",
    "poster": "/covers/posters/Avengers Age of Ultron-poster.jpg",
    "description": "Avengers: Age of Ultron is a 2015 American superhero film based on the Marvel Comics superhero team the Avengers. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the sequel to The Avengers (2012) and the 11th film in the Marvel Cinematic Universe (MCU). Written and directed by Joss Whedon, the film features an ensemble cast including Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans, Scarlett Johansson, Jeremy Renner, Don Cheadle, Aaron Taylor-Johnson, Elizabeth Olsen, Paul Bettany, Cobie Smulders, Anthony Mackie, Hayley Atwell, Idris Elba, Linda Cardellini, Stellan Skarsgård, James Spader, and Samuel L. Jackson. In the film, the Avengers fight Ultron (Spader)—an artificial intelligence created by Tony Stark (Downey) and Bruce Banner (Ruffalo)—who plans to bring about world peace by causing human extinction.",
    "type": "movie"
  },
  {
    "id": 35,
    "title": "The Fast and the Furious: Tokyo Drift",
    "year": 2006,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/The Fast and the Furious Tokyo Drift-thumbnail.jpg",
    "poster": "/covers/posters/The Fast and the Furious Tokyo Drift-poster.jpg",
    "description": "The Fast and the Furious: Tokyo Drift is a 2006 action film directed by Justin Lin and written by Chris Morgan. It is a standalone sequel to The Fast and the Furious (2001) and 2 Fast 2 Furious (2003), and the third installment in the Fast & Furious franchise. Within the story's continuity, the film is set between Fast & Furious 6 (2013) and Furious 7 (2015). It stars Lucas Black and Bow Wow. In the film, car enthusiast Sean Boswell (Black) is sent to live in Tokyo with his estranged father and finds solace exploring the city's drifting community.",
    "type": "movie"
  },
  {
    "id": 36,
    "title": "Harry Potter and the Deathly Hallows: Part 1",
    "year": 2010,
    "genre": "Fantasy",
    "thumbnail": "/covers/thumbnails/Harry Potter and the Deathly Hallows Part 1-thumbnail.jpg",
    "poster": "/covers/posters/Harry Potter and the Deathly Hallows Part 1-poster.jpg",
    "description": "Harry Potter and the Deathly Hallows – Part 1 is a 2010 fantasy film directed by David Yates from a screenplay by Steve Kloves.[5] The film is the first of two cinematic parts based on the 2007 novel Harry Potter and the Deathly Hallows by J. K. Rowling. It is the sequel to Harry Potter and the Half-Blood Prince (2009) and the seventh instalment in the Harry Potter film series.[6] The film stars Daniel Radcliffe as Harry Potter, with Rupert Grint and Emma Watson, respectively, reprising roles as Harry's best friends Ron Weasley and Hermione Granger. The story follows Harry Potter, who has been asked by Dumbledore to find and destroy Lord Voldemort's secret to immortality – the Horcruxes.",
    "type": "movie"
  },
  {
    "id": 37,
    "title": "Furious 7 ",
    "year": 2015,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Furious 7-thumbnail.jpg",
    "poster": "/covers/posters/Furious 7-poster.jpg",
    "description": "Furious 7 (also known as Fast & Furious 7) is a 2015 action film directed by James Wan and written by Chris Morgan. It is the sequel to Fast & Furious 6 (2013), a follow-up to The Fast and the Furious: Tokyo Drift (2006), and the seventh installment in the Fast & Furious franchise. The film stars an ensemble cast including Vin Diesel, Paul Walker (in his final film role), Dwayne Johnson, Michelle Rodriguez, Tyrese Gibson, Chris Ludacris Bridges, Jordana Brewster, Djimon Hounsou, Kurt Russell and Jason Statham. In the film, Dominic Toretto, Brian O'Conner and their team are recruited by covert ops leader Mr. Nobody to prevent Mose Jakande (Hounsou), a terrorist, from obtaining a hacking program known as God's Eye.",
    "type": "movie"
  },
  {
    "id": 38,
    "title": "Fast Five",
    "year": 2011,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Fast Five-thumbnail.jpg",
    "poster": "/covers/posters/Fast Five-poster.jpg",
    "description": "Fast Five (also known as Fast & Furious 5) is a 2011 action film directed by Justin Lin and written by Chris Morgan. It is the sequel to Fast & Furious (2009) and the fifth installment in the Fast & Furious franchise. The film stars Vin Diesel as Dominic Toretto and Paul Walker as Brian O'Conner, alongside Jordana Brewster, Tyrese Gibson, Gal Gadot, Chris Ludacris Bridges, Matt Schulze, Sung Kang and Dwayne Johnson. In the film, Dom and Brian, along with Dom's sister Mia plan a heist to steal $100 million from corrupt businessman Hernan Reyes while being pursued for arrest by U.S. Diplomatic Security Service (DSS) agent Luke Hobbs.",
    "type": "movie"
  },
  {
    "id": 39,
    "title": "Ted",
    "year": 2012,
    "genre": "Comedy",
    "thumbnail": "/covers/thumbnails/Ted-thumbnail.jpg",
    "poster": "/covers/posters/Ted-poster.jpg",
    "description": "Ted (stylized in all lowercase) is a 2012 American fantasy buddy comedy film directed and co-produced by Seth MacFarlane and written by MacFarlane, Alec Sulkin, and Wellesley Wild based on a story written by MacFarlane. The first installment in the Ted franchise, the film stars Mark Wahlberg and Mila Kunis, with Joel McHale and Giovanni Ribisi in supporting roles, and MacFarlane providing the voice and motion capture of the title character. The film tells the story of John Bennett, a Boston native whose childhood wish brings his teddy bear friend Ted to life. However, in adulthood, Ted and John's friendship begins to interfere with the progression of John's relationship with his girlfriend, Lori Collins.",
    "type": "movie"
  },
  {
    "id": 40,
    "title": "Scarface",
    "year": 1983,
    "genre": "Crime",
    "thumbnail": "/covers/thumbnails/Scarface-thumbnail.jpg",
    "poster": "/covers/posters/Scarface-poster.jpg",
    "description": "Scarface is a 1983 American crime drama film directed by Brian De Palma, written by Oliver Stone and starring Al Pacino. It is a remake of the 1932 film, in turn based on the 1930 novel. It tells the story of Cuban refugee Tony Montana, who arrives in Miami during the Mariel boatlift and becomes a powerful drug lord. The film co-stars Michelle Pfeiffer, Stephen Bauer, Robert Loggia and Mary Elizabeth Mastrantonio.",
    "type": "movie"
  },
  {
    "id": 41,
    "title": "Doctor Strange",
    "year": 2016,
    "genre": "Fantasy",
    "thumbnail": "/covers/thumbnails/Doctor Strange-thumbnail.jpg",
    "poster": "/covers/posters/Doctor Strange-poster.jpg",
    "description": "Doctor Strange is a 2016 American superhero film based on the Marvel Comics character of the same name. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the 14th film in the Marvel Cinematic Universe (MCU). The film was directed by Scott Derrickson from a screenplay he wrote with Jon Spaihts and C. Robert Cargill, and stars Benedict Cumberbatch as neurosurgeon Stephen Strange along with Chiwetel Ejiofor, Rachel McAdams, Benedict Wong, Michael Stuhlbarg, Benjamin Bratt, Scott Adkins, Mads Mikkelsen, and Tilda Swinton. In the film, Strange learns the mystic arts after a career-ending car crash.",
    "type": "movie"
  },
  {
    "id": 42,
    "title": "Taken 3",
    "year": 2015,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Taken 3-thumbnail.jpg",
    "poster": "/covers/posters/Taken 3-poster.jpg",
    "description": "Taken 3 (sometimes stylized as TAK3N) is a 2015 English-language action-thriller film that is the third and final film in the Taken trilogy, starring Liam Neeson as a former government operative. The French production was directed by Olivier Megaton and written by Luc Besson and Robert Mark Kamen. The cast also includes Forest Whitaker, Maggie Grace, and Famke Janssen. Mills (Neeson) is falsely accused of murder and gets tracked by a police inspector (Whitaker) and uses his skill set to prove his innocence and find the real murderer.",
    "type": "movie"
  },
  {
    "id": 43,
    "title": "Black Panther: Wakanda Forever",
    "year": 2022,
    "genre": "Fantasy",
    "thumbnail": "/covers/thumbnails/Black Panther Wakanda Forever-thumbnail.jpg",
    "poster": "/covers/posters/Black Panther Wakanda Forever-poster.jpg",
    "description": "Black Panther: Wakanda Forever is a 2022 American superhero film based on Marvel Comics featuring the character Shuri / Black Panther. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the sequel to Black Panther (2018) and the 30th film in the Marvel Cinematic Universe (MCU). Directed by Ryan Coogler, who co-wrote the screenplay with Joe Robert Cole, the film stars Letitia Wright as Shuri / Black Panther, alongside Lupita Nyong'o, Danai Gurira, Winston Duke, Florence Kasumba, Dominique Thorne, Michaela Coel, Mabel Cadena, Tenoch Huerta Mejía, Martin Freeman, Julia Louis-Dreyfus, and Angela Bassett. In the film, the leaders of Wakanda fight to protect their nation in the wake of King T'Challa's death.",
    "type": "movie"
  },
  {
    "id": 44,
    "title": "Doctor Strange in the Multiverse of Madness",
    "year": 2022,
    "genre": "Fantasy",
    "thumbnail": "/covers/thumbnails/Doctor Strange in the Multiverse of Madness-thumbnail.jpg",
    "poster": "/covers/posters/Doctor Strange in the Multiverse of Madness-poster.jpg",
    "description": "Doctor Strange in the Multiverse of Madness is a 2022 American superhero film based on Marvel Comics featuring the character Doctor Strange. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the sequel to Doctor Strange (2016) and the 28th film in the Marvel Cinematic Universe (MCU). The film was directed by Sam Raimi, written by Michael Waldron, and stars Benedict Cumberbatch as Stephen Strange, alongside Elizabeth Olsen, Chiwetel Ejiofor, Benedict Wong, Xochitl Gomez, Michael Stuhlbarg, and Rachel McAdams. In the film, Strange must protect America Chavez (Gomez), a teenager capable of traveling the multiverse, from the Scarlet Witch (Olsen).",
    "type": "movie"
  },
  {
    "id": 45,
    "title": "Spider-Man 3",
    "year": 2007,
    "genre": "Fantasy",
    "thumbnail": "/covers/thumbnails/Spider-Man 3-thumbnail.jpg",
    "poster": "/covers/posters/Spider-Man 3-poster.jpg",
    "description": "Spider-Man 3 is a 2007 American superhero film based on the Marvel Comics character Spider-Man. Produced by Columbia Pictures, Marvel Entertainment, and Laura Ziskin Productions, and distributed by Sony Pictures Releasing, it was directed by Sam Raimi from a screenplay he co-wrote with his brother Ivan and Alvin Sargent. It is the final installment in Raimi's Spider-Man trilogy, and the sequel to Spider-Man (2002) and Spider-Man 2 (2004). The film stars Tobey Maguire as Peter Parker / Spider-Man, alongside Kirsten Dunst, James Franco, Thomas Haden Church, Topher Grace, Bryce Dallas Howard, James Cromwell, Rosemary Harris, and J. K. Simmons. It also marks the final acting appearance of Cliff Robertson before his retirement from acting in the same year and his subsequent death in 2011. Set a year after the events of Spider-Man 2, the film follows Peter Parker as he prepares for his future with Mary Jane Watson, while facing multiple threats: Flint Marko, Uncle Ben's true killer who becomes the Sandman after a freak accident; Harry Osborn, his former best friend who is now aware of Peter's identity and seeks to avenge his father; an extraterrestrial symbiote that increases his abilities but amplifies his anger and other negative traits; and Eddie Brock, a rival photographer who becomes the symbiote's second host Venom.",
    "type": "movie"
  },
  {
    "id": 46,
    "title": "Logan ",
    "year": 2017,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Logan-thumbnail.jpg",
    "poster": "/covers/posters/Logan-poster.jpg",
    "description": "Logan is a 2017 American superhero film starring Hugh Jackman as the titular character. Based on the Marvel Comics character Wolverine, the film was directed by James Mangold, who co-wrote the screenplay with Michael Green and Scott Frank from a story by Mangold. It is the tenth film in the X-Men film series and the third and final installment in the Wolverine trilogy, following X-Men Origins: Wolverine (2009) and The Wolverine (2013). The film, which takes inspiration from the Old Man Logan comics storyline by Mark Millar and Steve McNiven, follows an aged Wolverine and an extremely ill Charles Xavier who must defend a young mutant named Laura from the Reavers led by Donald Pierce and Zander Rice. In addition to Jackman, the film also stars Patrick Stewart, Richard E. Grant, Boyd Holbrook, Stephen Merchant, and introduces Dafne Keen in her film debut as Laura.",
    "type": "movie"
  },
  {
    "id": 47,
    "title": "Avatar ",
    "year": 2009,
    "genre": "Fantasy",
    "thumbnail": "/covers/thumbnails/Avatar-thumbnail.jpg",
    "poster": "/covers/posters/Avatar-poster.jpg",
    "description": "Avatar is a 2009 epic science fiction film co-produced, co-edited, written, and directed by James Cameron. It features an ensemble cast including Sam Worthington, Zoe Saldana, Stephen Lang, Michelle Rodriguez, and Sigourney Weaver.[6] Distributed by 20th Century Fox,[a][b] the first installment in the Avatar film series, it is set in the mid-22nd century, when humans are colonizing Pandora, a lush habitable moon of a gas giant in the Alpha Centauri star system, in order to mine the valuable unobtanium,[c] a room-temperature superconductor mineral. The expansion of the mining colony threatens the continued existence of a local tribe of Na'vi, a humanoid species indigenous to Pandora. The title of the film refers to a genetically engineered Na'vi body operated from the brain of a remotely located human that is used to interact with the natives of Pandora called an Avatar.",
    "type": "movie"
  },
  {
    "id": 48,
    "title": "The Ice Road",
    "year": 2021,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/The Ice Road-thumbnail.jpg",
    "poster": "/covers/posters/The Ice Road-poster.jpg",
    "description": "The Ice Road is a 2021 American action thriller film written and directed by Jonathan Hensleigh. The film stars Liam Neeson, Laurence Fishburne, Benjamin Walker, Amber Midthunder, Marcus Thomas, Holt McCallany, Martin Sensmeier, Matt McCoy, and Matt Salinger. The movie is influenced by 1953 film The Wages of Fear by Henri-Georges Clouzot who based his film on the novel of the same name written by Georges Arnaud",
    "type": "movie"
  },
  {
    "id": 49,
    "title": "Interstellar ",
    "year": 2014,
    "genre": "Science",
    "thumbnail": "/covers/thumbnails/Interstellar-thumbnail.jpg",
    "poster": "/covers/posters/Interstellar-poster.jpg",
    "description": "Interstellar is a 2014 epic science fiction film directed by Christopher Nolan, who co-wrote the screenplay with his brother Jonathan Nolan. It features an ensemble cast led by Matthew McConaughey, Anne Hathaway, Jessica Chastain, Bill Irwin, Ellen Burstyn and Michael Caine. Set in a dystopian future where Earth is suffering from catastrophic blight and famine, the film follows a group of astronauts who travel through a wormhole near Saturn in search of a new home for mankind.",
    "type": "movie"
  },
  {
    "id": 50,
    "title": "The Beekeeper",
    "year": 2024,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/The Beekeeper-thumbnail.jpg",
    "poster": "/covers/posters/The Beekeeper-poster.jpg",
    "description": "The Beekeeper is a 2024 action thriller film produced and directed by David Ayer and written by Kurt Wimmer. It stars Jason Statham, Emmy Raver-Lampman, Josh Hutcherson, Bobby Naderi, Minnie Driver, Phylicia Rashad, and Jeremy Irons. The film follows a retired government assassin who sets out for revenge after his kind-hearted landlady falls victim to a phishing scam.",
    "type": "movie"
  },
  {
    "id": 51,
    "title": "13 Reasons Why",
    "year": 2017,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/13 Reasons Why-thumbnail.jpg",
    "poster": "/covers/posters/13 Reasons Why-poster.jpg",
    "description": "Newcomer Katherine Langford plays the role of Hannah, a young woman who takes her own life. Two weeks after her tragic death, a classmate named Clay finds a mysterious box on his porch. Inside the box are recordings made by Hannah --- on whom Clay had a crush --- in which she explains the 13 reasons why she chose to commit suicide",
    "type": "series"
  },
  {
    "id": 52,
    "title": "24",
    "year": 2001,
    "genre": "Thriller",
    "thumbnail": "/covers/thumbnails/24-thumbnail.jpg",
    "poster": "/covers/posters/24-poster.jpg",
    "description": "24 is an American action drama television series created by Joel Surnow and Robert Cochran for Fox. The series features an ensemble cast, with Kiefer Sutherland starring as American counter-terrorist federal agent Jack Bauer. Each season covers 24 consecutive hours using the real time method of narration, which is emphasized by the display of split screens and a digital clock. Multiple ongoing plot lines of intersecting relevance are covered, with Bauer's plot line serving as the link throughout. The show premiered on November 6, 2001, and spanned 204 episodes over nine seasons, with the series finale broadcast on July 14, 2014. In addition, the television film 24: Redemption aired between seasons six and seven, on November 23, 2008. 24 is a joint production by Imagine Television and 20th Century Fox Television.",
    "type": "series"
  },
  {
    "id": 53,
    "title": "1899",
    "year": 2023,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/1899-thumbnail.jpg",
    "poster": "/covers/posters/1899-poster.jpg",
    "description": "1899 is a multilingual German mystery science fiction television series created by Jantje Friese and Baran bo Odar. It premiered on Netflix in November 2022 and received generally favourable reviews. The series was cancelled in January 2023.",
    "type": "series"
  },
  {
    "id": 54,
    "title": "Alice in Borderland",
    "year": 2020,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/Alice in Borderland-thumbnail.jpg",
    "poster": "/covers/posters/Alice in Borderland-poster.jpg",
    "description": "Alice in Borderland (Japanese: 今際の国のアリス, Hepburn: Imawa no Kuni no Arisu) is a Japanese science fiction thriller drama television series based on the manga of the same name by Haro Aso. The series is directed by Shinsuke Sato. It stars Kento Yamazaki and Tao Tsuchiya as allies trapped in an empty, parallel version of Tokyo, forced to compete as players in dangerous, sadistic games. The type and difficulty of each game is represented by playing cards based on French suites and the games are used to extend their  that, if expired, result in the player's execution by lasers shot from the sky.",
    "type": "series"
  },
  {
    "id": 55,
    "title": "Another Life",
    "year": 2019,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/Another Life-thumbnail.jpg",
    "poster": "/covers/posters/Another Life-poster.jpg",
    "description": "Another Life is an American science fiction drama television series created by Aaron Martin, which premiered on Netflix on July 25, 2019.[1] The series stars Katee Sackhoff, Selma Blair, Justin Chatwin, Samuel Anderson, Elizabeth Ludlow, Blu Hunt, A.J. Rivera, Alexander Eling, Alex Ozerov, Jake Abel, JayR Tinaco, Lina Renna, Jessica Camacho, Barbara Williams, Parveen Dosanjh, Greg Hovanessian, Chanelle Peloso, and Tyler Hoechlin. In October 2019, the series was renewed for a second season, which was released on October 14, 2021.[2][3] Netflix announced it had canceled the series in February 2022",
    "type": "series"
  },
  {
    "id": 56,
    "title": "Bad Cop",
    "year": 2024,
    "genre": "Thriller",
    "thumbnail": "/covers/thumbnails/Bad Cop-thumbnail.jpg",
    "poster": "/covers/posters/Bad Cop-poster.jpg",
    "description": "Bad Cop is Hindi-language crime thriller television series written by Rensil D'Silva and Rehan Khan and directed by Aditya Datt. It stars Anurag Kashyap, Gulshan Devaiah, Harleen Sethi, Saurabh Sachdeva, Anupam K. Sinha, Subham Sharma, Shatrughan Kumar, and Aishwarya Sushmita",
    "type": "series"
  },
  {
    "id": 57,
    "title": "Band Of Brothers",
    "year": 2001,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/Band Of Brothers-thumbnail.jpg",
    "poster": "/covers/posters/Band Of Brothers-poster.jpg",
    "description": "Band of Brothers is a 2001 American[2] war drama miniseries based on historian Stephen E. Ambrose's 1992 non-fiction book of the same name.[3] It was created by Steven Spielberg and Tom Hanks, who also served as executive producers, and who had collaborated on the 1998 World War II film Saving Private Ryan, where the series got many of its visual cues and crew members.[4] Episodes first aired on HBO from September 9 to November 4, 2001.",
    "type": "series"
  },
  {
    "id": 58,
    "title": "Begins ≠ Youth",
    "year": 2024,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/Begins ≠ Youth-thumbnail.jpg",
    "poster": "/covers/posters/Begins ≠ Youth-poster.jpg",
    "description": "Begins ≠ Youth (Korean: 비긴즈유스) is a 2024 South Korean drama television series based on the BTS Universe, starring Seo Ji-hoon, Noh Jong-hyun, Ahn Ji-ho, Seo Young-joo, Kim Yoon-woo, Jung Woo-jin, and Jeon Jin-seo. It was released on Xclusive from April 30, to May 14, 2024, every Tuesday at 16:00 (KST).",
    "type": "series"
  },
  {
    "id": 59,
    "title": "Billionaires' Bunker",
    "year": 2025,
    "genre": "Thriller",
    "thumbnail": "/covers/thumbnails/Billionaires' Bunker-thumbnail.jpg",
    "poster": "/covers/posters/Billionaires' Bunker-poster.jpg",
    "description": "In the face of the threat posed by an imminent nuclear war, a group of billionaires hide in a bunker called the Kimera Underground Park. Resentment between two families is fueled in the claustrophobic environment",
    "type": "series"
  },
  {
    "id": 60,
    "title": "Boiling Point",
    "year": 2023,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/Boiling Point-v.jpg",
    "poster": "/covers/posters/Boiling Point-poster.jpg",
    "description": "Boiling Point is a four-episode British television drama miniseries created by Philip Barantini, James Cummings, and Stephen Graham. Co-directed by Barantini and Mounia Akl, it is a continuation and standalone sequel of the 2021 film Boiling Point, also directed by Barantini and featuring many of the same cast. Starring Stephen Graham, Vinette Robinson, and Hannah Walters, the series premiered on BBC One on 1 October 2023, with all episodes released on BBC iPlayer on the same day. It was made for the BBC by Ascendant Fox, Matriarch Productions, and It's All Made Up Productions",
    "type": "series"
  },
  {
    "id": 61,
    "title": "Breaking Bad",
    "year": 2008,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/Breaking Bad-thumbnail.jpg",
    "poster": "/covers/posters/Breaking Bad-poster.jpg",
    "description": "Breaking Bad is an American neo-Western crime drama television series created and produced by Vince Gilligan for AMC. Set and filmed in Albuquerque, New Mexico, the series follows Walter White (Bryan Cranston), an over-qualified, dispirited high-school chemistry teacher struggling with a recent diagnosis of stage-three lung cancer. White turns to a life of crime and partners with a former student, Jesse Pinkman (Aaron Paul), to produce and distribute methamphetamine to secure his family's financial future before he dies, while navigating the dangers of the criminal underworld. The series also stars Anna Gunn, Dean Norris, RJ Mitte, Betsy Brandt, Giancarlo Esposito, Jonathan Banks, and Bob Odenkirk.",
    "type": "series"
  },
  {
    "id": 62,
    "title": "Chernobyl",
    "year": 2019,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/Chernobyl-thumbnail.jpg",
    "poster": "/covers/posters/Chernobyl-poster.jpg",
    "description": "Chernobyl is a 2019 historical drama television miniseries that revolves around the Chernobyl disaster of 1986 and the cleanup efforts that followed. The series was created and written by Craig Mazin and directed by Johan Renck. It features an ensemble cast led by Jared Harris, Stellan Skarsgård, Emily Watson, and Paul Ritter. The series was produced by HBO in the United States and Sky UK in the United Kingdom",
    "type": "series"
  },
  {
    "id": 63,
    "title": "Do You Wanna Partner",
    "year": 2025,
    "genre": "Comedy",
    "thumbnail": "/covers/thumbnails/Do You Wanna Partner-thumbnail.jpg",
    "poster": "/covers/posters/Do You Wanna Partner-poster.jpg",
    "description": "Do You Wanna Partner is an Indian Hindi-language comedy drama series that premiered on Amazon Prime Video on 12 September 2025. Produced by Dharmatic Entertainment, it is directed by Archit Kumar and Collin D'Cunha and stars Tamannaah Bhatia and Diana Penty as two friends launching a craft beer startup in a male-dominated industry. The series explores female entrepreneurship, friendship, and resourcefulness, with an ensemble cast including Nakuul Mehta, Jaaved Jaaferi, Neeraj Kabi, Shweta Tiwari, Rannvijay Singha, Ayesha Raza Mishra and Sufi Motiwala",
    "type": "series"
  },
  {
    "id": 64,
    "title": "Doona!",
    "year": 2023,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/Doona-thumbnail.jpg",
    "poster": "/covers/posters/Doona-poster.jpg",
    "description": "Doo-na! (Korean: 이두나!) is a 2023 South Korean romance television series starring Bae Suzy and Yang Se-jong, based on the Naver webtoon The Girl Downstairs by Min Song-ah. It was released on Netflix on October 20, 2023",
    "type": "series"
  },
  {
    "id": 65,
    "title": "Eric",
    "year": 2024,
    "genre": "Thriller",
    "thumbnail": "/covers/thumbnails/Eric-thumbnail.jpg",
    "poster": "/covers/posters/Eric-poster.jpg",
    "description": "Eric is a 2024 British psychological thriller television drama created by Abi Morgan for the streaming service Netflix. It stars Benedict Cumberbatch as a distraught puppeteer whose young son goes missing in 1980s New York City. The script was written by Morgan with Lucy Forbes directing and Holly Pullinger producing the series. The series was released on 30 May 2024",
    "type": "series"
  },
  {
    "id": 66,
    "title": "Gen V",
    "year": 2023,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/Gen V-thumbnail.jpg",
    "poster": "/covers/posters/Gen V-poster.jpg",
    "description": "Gen V is an American satirical superhero television series, developed by Craig Rosenberg, Evan Goldberg, and Eric Kripke, serving as a spin-off of The Boys by Kripke, and loosely based on The Boys comic book story arc We Gotta Go Now by Garth Ennis, Darick Robertson, and John Higgins. The series serves as the third television series in The Boys franchise and its first season is set before the fourth season of The Boys, while its second season is set after it",
    "type": "series"
  },
  {
    "id": 67,
    "title": "Hijack",
    "year": 2023,
    "genre": "Thriller",
    "thumbnail": "/covers/thumbnails/Hijack-thumbnail.jpg",
    "poster": "/covers/posters/Hijack-poster.jpg",
    "description": "Hijack (stylised as H/JACK) is a thriller television series created by George Kay and Jim Field Smith, with Idris Elba starring in the lead role. It premiered on 28 June 2023 on Apple TV+. In January 2024, it was renewed for a second season",
    "type": "series"
  },
  {
    "id": 68,
    "title": "In Treatment",
    "year": 2008,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/In Treatment-thumbnail.jpg",
    "poster": "/covers/posters/In Treatment-poster.jpg",
    "description": "In Treatment is an American drama television series for HBO, produced and developed by Rodrigo Garcia, based on the Israeli series BeTipul (Hebrew: בטיפול), created by Hagai Levi, Ori Sivan and Nir Bergman",
    "type": "series"
  },
  {
    "id": 69,
    "title": "Lady in the Lake",
    "year": 2024,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/Lady in the Lake-thumbnail.jpg",
    "poster": "/covers/posters/Lady in the Lake-poster.jpg",
    "description": "Lady in the Lake is an American period drama television miniseries based on the novel of the same name by Laura Lippman. The series premiered on Apple TV+ on July 19, 2024.[1] It is set during the 1960s. Lady in the Lake begins in Baltimore, with the disappearance of a young Jewish girl, Tessie Durst, at a Christmas parade. The two lead characters are Maddie Schwartz (Natalie Portman), a Jewish housewife and mother, and Cleo Johnson (Moses Ingram), an African-American mother, wife and bartender. Tessie's disappearance and Cleo's murder mystery arouse Maddie's latent journalistic instincts.",
    "type": "series"
  },
  {
    "id": 70,
    "title": "Locke & Key",
    "year": 2020,
    "genre": "Horror",
    "thumbnail": "/covers/thumbnails/Locke & Key-thumbnail.jpg",
    "poster": "/covers/posters/Locke & Key-poster.jpg",
    "description": "Locke & Key is an American fantasy drama television series[1][2] developed by Carlton Cuse, Meredith Averill, and Aron Eli Coleite, based on the comic book series of the same name by Joe Hill and Gabriel Rodríguez. It premiered on Netflix on February 7, 2020.[3] The series stars Darby Stanchfield, Connor Jessup, Emilia Jones, Jackson Robert Scott, Laysla De Oliveira, Petrice Jones, and Griffin Gluck.",
    "type": "series"
  },
  {
    "id": 71,
    "title": "Loki",
    "year": 2021,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Loki-thumbnail.jpg",
    "poster": "/covers/posters/Loki-poster.jpg",
    "description": "Loki is an American television series created by Michael Waldron for the streaming service Disney+, based on Marvel Comics featuring the character of the same name. It is the third television series in the Marvel Cinematic Universe (MCU) produced by Marvel Studios, sharing continuity with the films of the franchise. The series takes place after the events of the film Avengers: Endgame (2019), in which an alternate version of Loki created a new timeline. Waldron served as head writer and Kate Herron directed the first season, with Eric Martin and the duo Justin Benson and Aaron Moorhead serving as head writer and leading the directing team for the second season, respectively",
    "type": "series"
  },
  {
    "id": 72,
    "title": "Maledictions",
    "year": 2025,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/Maledictions-thumbnail.jpg",
    "poster": "/covers/posters/Maledictions-poster.jpg",
    "description": "At a career-defining moment, a governor's child vanishes; torn between ambition and family secrets, the governor must choose between politics or his daughter's safety",
    "type": "series"
  },
  {
    "id": 73,
    "title": "Marvel's Iron Fist",
    "year": 2017,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Marvel's Iron Fist-thumbnail.jpg",
    "poster": "/covers/posters/Marvel's Iron Fist-poster.jpg",
    "description": "Marvel's Iron Fist is an American television series created by Scott Buck for the streaming service Netflix, based on the Marvel Comics character of the same name. It is set in the Marvel Cinematic Universe (MCU), sharing continuity with the franchise's films, and was the fourth Marvel Netflix series leading to the crossover miniseries The Defenders (2017). The series was produced by Marvel Television in association with ABC Studios, with Devilina Productions also producing in the first season. Buck served as showrunner for the first season; Raven Metzner took over for the second",
    "type": "series"
  },
  {
    "id": 74,
    "title": "Moon Knight",
    "year": 2022,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Moon Knight-thumbnail.jpg",
    "poster": "/covers/posters/Moon Knight-poster.jpg",
    "description": "Moon Knight is an American television miniseries created by Jeremy Slater for the streaming service Disney+, based on Marvel Comics featuring the character of the same name. It is the sixth television series in the Marvel Cinematic Universe (MCU) to be produced by Marvel Studios, sharing continuity with the films of the franchise. It follows Marc Spector and Steven Grant, two alters of a man with dissociative identity disorder (DID), as they are drawn into a mystery involving Egyptian gods. Slater serves as head writer with Mohamed Diab leading the directing team",
    "type": "series"
  },
  {
    "id": 75,
    "title": "One Hundred Years of Solitude",
    "year": 2024,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/One Hundred Years of Solitude-thumbnail.jpg",
    "poster": "/covers/posters/One Hundred Years of Solitude-poster.jpg",
    "description": "One Hundred Years of Solitude (Spanish: Cien años de soledad, Latin American Spanish: [sjen ˈaɲos ðe soleˈðað]) is a Colombian television series based on Gabriel García Márquez's 1967 novel of the same name. The series will run for 16 episodes on Netflix, with the first eight released on 11 December 2024",
    "type": "series"
  },
  {
    "id": 76,
    "title": "One Piece",
    "year": 2023,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/One Piece-thumbnail.jpg",
    "poster": "/covers/posters/One Piece-poster.jpg",
    "description": "One Piece (stylized in all caps) is a fantasy adventure television series developed by Matt Owens and Steven Maeda for Netflix. The series is a live-action adaptation of the manga series of the same name by Eiichiro Oda, who serves as creative consultant for the show. It is produced by Kaji Productions and Shueisha, who also publishes the manga. The series stars an ensemble cast including Iñaki Godoy, Emily Rudd, Mackenyu, Jacob Romero Gibson, and Taz Skylar as the members of the Straw Hat Pirates",
    "type": "series"
  },
  {
    "id": 77,
    "title": "Ozark",
    "year": 2017,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/Ozark-thumbnail.jpg",
    "poster": "/covers/posters/Ozark-poster.jpg",
    "description": "Ozark is an American crime drama television series created by Bill Dubuque and Mark Williams for Netflix and produced by MRC Television and Aggregate Films.[2][3][4] The series stars Jason Bateman and Laura Linney as Marty and Wendy Byrde, a married couple who moves their family to the Lake of the Ozarks to continue their work laundering money for a Mexican drug cartel.[5][6] Bateman also serves as a director and executive producer for the series",
    "type": "series"
  },
  {
    "id": 78,
    "title": "Peaky Blinders",
    "year": 2013,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/Peaky Blinders-thumbnail.jpg",
    "poster": "/covers/posters/Peaky Blinders-poster.jpg",
    "description": "Peaky Blinders is a British historical crime drama television series created by Steven Knight. Set in Birmingham, it follows the exploits of the Peaky Blinders crime gang in the direct aftermath of the First World War. The fictional gang is loosely based on a real urban youth gang active in the city from the 1880s to the 1920s.",
    "type": "series"
  },
  {
    "id": 79,
    "title": "Percy Jackson and the Olympians",
    "year": 2021,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/Percy Jackson and the Olympians-thumbnail.jpg",
    "poster": "/covers/posters/Percy Jackson and the Olympians-poster.jpg",
    "description": "Percy Jackson and the Olympians is an American fantasy television series created by Rick Riordan and Jonathan E. Steinberg for Disney+, based on the book series of the same name by Riordan. Walker Scobell stars as Percy Jackson, alongside Leah Sava Jeffries as Annabeth Chase and Aryan Simhadri as Grover Underwood",
    "type": "series"
  },
  {
    "id": 80,
    "title": "Prison Break",
    "year": 2005,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/Prison Break-thumbnail.jpg",
    "poster": "/covers/posters/Prison Break-poster.jpg",
    "description": "Prison Break is an American crime drama television series created by Paul Scheuring for Fox. The series revolves around two brothers: Lincoln Burrows (Dominic Purcell) and Michael Scofield (Wentworth Miller); Lincoln has been sentenced to death for a crime he did not commit, while Michael devises an elaborate plan to help his brother escape prison and clear his name. Along with creator Paul Scheuring, the series was executive-produced by Matt Olmstead, Kevin Hooks, Marty Adelstein, Dawn Parouse, Neal H. Moritz, and Brett Ratner who directed the pilot episode. The series' theme music, composed by Ramin Djawadi, was nominated for a Primetime Emmy Award in 2006.[1] Prison Break is a joint production between Original Film, Adelstein/Parouse Productions (seasons 1–4), Dawn Olmstead Productions (season 5), Adelstein Productions (season 5), One Light Road Productions (season 5), and 20th Century Fox Television.",
    "type": "series"
  },
  {
    "id": 81,
    "title": "Shardlake",
    "year": 2024,
    "genre": "Thriller ",
    "thumbnail": "/covers/thumbnails/Shardlake-thumbnail.jpg",
    "poster": "/covers/posters/Shardlake-poster.jpg",
    "description": "Shardlake is a four-part television series on Disney+ based on the Shardlake series of historical mystery novels by C. J. Sansom set in the reign of Henry VIII in the 16th century. The series is adapted by Stephen Butchard and directed by Justin Chadwick and produced by The Forge. Arthur Hughes stars as the eponymous Matthew Shardlake, alongside Sean Bean as Thomas Cromwell. C. J. Sansom died on 27 April 2024, just four days before the series premiere.[1] In January 2025, the series was cancelled after one season",
    "type": "series"
  },
  {
    "id": 82,
    "title": "Sherlock",
    "year": 2010,
    "genre": "Crime",
    "thumbnail": "/covers/thumbnails/Sherlock-thumbnail.jpg",
    "poster": "/covers/posters/Sherlock-poster.jpg",
    "description": "Sherlock is a British mystery crime drama television series based on Sir Arthur Conan Doyle's Sherlock Holmes detective stories. Created by Steven Moffat and Mark Gatiss, the show starred Benedict Cumberbatch as Sherlock Holmes and Martin Freeman as Doctor John Watson. Thirteen episodes were produced, with four three-part series airing from 2010 to 2017 and a special episode that aired on 1 January 2016. The series is set in the present day in which it aired. The one-off special features a Victorian-period fantasy resembling the original Holmes stories",
    "type": "series"
  },
  {
    "id": 83,
    "title": "Snowpiercer",
    "year": 2020,
    "genre": "Thriller",
    "thumbnail": "/covers/thumbnails/Snowpiercer-thumbnail.jpg",
    "poster": "/covers/posters/Snowpiercer-poster.jpg",
    "description": "Snowpiercer is an American post-apocalyptic dystopian thriller television series that premiered on May 17, 2020, on TNT. It is based on both the 2013 film of the same name, directed by Bong Joon-ho, and the 1982 French graphic novel Le Transperceneige by Jacques Lob, Benjamin Legrand and Jean-Marc Rochette, from which the film was adapted",
    "type": "series"
  },
  {
    "id": 84,
    "title": "Spy × Family",
    "year": 2023,
    "genre": "Crime",
    "thumbnail": "/covers/thumbnails/Spy × Family-thumbnail.jpeg",
    "poster": "/covers/posters/Spy × Familyposter.jpeg",
    "description": "Spy × Family (stylized as SPY×FAMILY and pronounced spy family)[3][4][5] is a Japanese web manga series written and illustrated by Tatsuya Endo. The story follows Loid Forger, an enigmatic spy who has to build a family to execute a mission, not realizing that his adopted daughter is a telepath, and the woman he agrees to marry is a skilled assassin. The series has been serialized biweekly on Shueisha's Shōnen Jump+ app and website since March 2019, with its chapters collected in 15 tankōbon volumes as of March 2025. It is licensed in North America by Viz Media",
    "type": "series"
  },
  {
    "id": 85,
    "title": "The Blacklist",
    "year": 2013,
    "genre": "Crime",
    "thumbnail": "/covers/thumbnails/The Blacklist-thumbnail.jpg",
    "poster": "/covers/posters/The Blacklist-poster.jpg",
    "description": "The Blacklist is an American crime thriller television series created by Jon Bokenkamp and developed by John Eisendrath. It stars James Spader as Raymond Reddington, an international criminal and one of the FBI's Most Wanted fugitives who cooperates with the FBI in hunting down other criminals on his Blacklist. The series also stars Megan Boone, Diego Klattenhoff, Ryan Eggold, Amir Arison, Hisham Tawfiq, and Harry Lennix",
    "type": "series"
  },
  {
    "id": 86,
    "title": "The Continental",
    "year": 2023,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/The Continental-thumbnail.jpg",
    "poster": "/covers/posters/The Continental-poster.jpg",
    "description": "The Continental: From the World of John Wick (or simply The Continental ) is an American neo noir crime-action drama television miniseries developed by Greg Coolidge, Kirk Ward, and Shawn Simmons that serves as a spin-off and a prequel in the John Wick franchise. Coolidge and Ward served as showrunners for the series and wrote the scripts alongside Simmons and Ken Kristensen. Albert Hughes directed the first and third episodes, and Charlotte Brändström directed the second. The show stars Mel Gibson and Colin Woodell",
    "type": "series"
  },
  {
    "id": 87,
    "title": "The Crowded Room",
    "year": 2023,
    "genre": "Thriller",
    "thumbnail": "/covers/thumbnails/The Crowded Room-thumbnail.jpg",
    "poster": "/covers/posters/The Crowded Room-poster.jpg",
    "description": "The Crowded Room is an American psychological thriller miniseries created by Akiva Goldsman and inspired by the 1981 non-fiction novel The Minds of Billy Milligan by Daniel Keyes. Tom Holland, Amanda Seyfried, and Emmy Rossum lead a supporting cast that includes Sasha Lane, Will Chase, Lior Raz, Laila Robins, and Henry Eikenberry",
    "type": "series"
  },
  {
    "id": 88,
    "title": "The Fall of the House of Usher",
    "year": 2023,
    "genre": "Horror",
    "thumbnail": "/covers/thumbnails/The Fall of the House of Usher-thumbnail.jpg",
    "poster": "/covers/posters/The Fall of the House of Usher-poster.jpg",
    "description": "The Fall of the House of Usher is an American gothic horror drama television miniseries created by Mike Flanagan. All eight episodes were released on Netflix on October 12, 2023, each directed by either Flanagan or Michael Fimognari, with the latter also acting as cinematographer for the entire series",
    "type": "series"
  },
  {
    "id": 89,
    "title": "The Handmaid's Tale",
    "year": 2017,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/The Handmaid's Tale-thumbnail.jpg",
    "poster": "/covers/posters/The Handmaid's Tale-poster.jpg",
    "description": "The Handmaid's Tale is an American dystopian television series created by Bruce Miller, based on the 1985 novel The Handmaid's Tale by Canadian author Margaret Atwood. The series was ordered by the streaming service Hulu as a straight-to-series order of ten episodes, for which production began in late 2016. The plot features a dystopia following a Second American Civil War wherein a theonomic, totalitarian society subjects fertile women, called Handmaids, to child-bearing slavery.",
    "type": "series"
  },
  {
    "id": 90,
    "title": "The Haunting of Hill House",
    "year": 2018,
    "genre": "Horror",
    "thumbnail": "/covers/thumbnails/The Haunting of Hill House-thumbnail.jpg",
    "poster": "/covers/posters/The Haunting of Hill House-poster.jpg",
    "description": "The Haunting of Hill House is an American supernatural horror drama television miniseries created and directed by Mike Flanagan, produced by Amblin Television and Paramount Television for Netflix, and serves as the first entry in The Haunting anthology series. It is loosely based on the 1959 novel of the same name by Shirley Jackson. The plot alternates between two timelines, following five adult siblings whose paranormal experiences at Hill House continue to haunt them in the present day, and flashbacks depicting events leading up to the eventful night in 1992 when the family fled from the mansion. The ensemble cast features Michiel Huisman, Elizabeth Reaser, Oliver Jackson-Cohen, Kate Siegel, and Victoria Pedretti as the siblings in adulthood, with Carla Gugino and Henry Thomas as parents Olivia and Hugh Crain, and Timothy Hutton appearing as an older version of Hugh",
    "type": "series"
  },
  {
    "id": 91,
    "title": "The Last of Us",
    "year": 2023,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/The Last of Us-thumbnail.jpg",
    "poster": "/covers/posters/The Last of Us-poster.jpg",
    "description": "The Last of Us is an American post-apocalyptic drama television series created by Craig Mazin and Neil Druckmann for HBO. Based on the video game franchise developed by Naughty Dog, the series is set decades after the collapse of society caused by a mass fungal infection that transforms its hosts into zombie-like creatures. The first season, based on 2013's The Last of Us, follows Joel (Pedro Pascal) and Ellie (Bella Ramsey) as they travel across the United States. In the second season, based on the first half of 2020's The Last of Us Part II, they have settled in Jackson, Wyoming, with Joel's brother Tommy (Gabriel Luna) and Ellie's friends Dina (Isabela Merced) and Jesse (Young Mazino). After Joel's death, the group travels to Seattle to track down his killer, Abby (Kaitlyn Dever), who is set to be the focus of the third season",
    "type": "series"
  },
  {
    "id": 92,
    "title": "The Punisher",
    "year": 2017,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/The Punisher-thumbnail.jpg",
    "poster": "/covers/posters/The Punisher-poster.jpg",
    "description": "Marvel's The Punisher is an American television series created by Steve Lightfoot for the streaming service Netflix, based on the Marvel Comics character Punisher. It is set in the Marvel Cinematic Universe (MCU), sharing continuity with the franchise's films and other television series. It is a spin-off from the first Marvel Netflix series, Daredevil (2015–2018). The Punisher was produced by Marvel Television in association with ABC Studios and Bohemian Risk Productions, with Lightfoot serving as showrunner",
    "type": "series"
  },
  {
    "id": 93,
    "title": "The Terminal List: Dark Wolf",
    "year": 2025,
    "genre": "Thriller",
    "thumbnail": "/covers/thumbnails/The Terminal List Dark Wolf-thumbnail.jpg",
    "poster": "/covers/posters/The Terminal List Dark Wolf-poster.jpg",
    "description": "The Terminal List: Dark Wolf is an American action thriller television series based on characters from the 2018 novel The Terminal List by Jack Carr. Created by Carr and David DiGilio, the series is a prequel to The Terminal List, in which the story follows Ben Edwards throughout his journey as a Navy SEAL to the CIA delving into the darker side of warfare and its human cost.",
    "type": "series"
  },
  {
    "id": 94,
    "title": "The Watchers",
    "year": 2024,
    "genre": "Thriller ",
    "thumbnail": "/covers/thumbnails/The Watchers-thumbnail.jpg",
    "poster": "/covers/posters/The Watchers-poster.jpg",
    "description": "The Watchers is a 2024 American supernatural horror fantasy film written for the screen and directed by Ishana Night Shyamalan in her directorial debut, produced by her father M. Night Shyamalan, and based on the 2021 novel by A. M. Shine.[5][6] It stars Dakota Fanning, Georgina Campbell, Olwen Fouéré and Oliver Finnegan, and follows Mina, a 28-year-old artist who becomes trapped in a vast, untouched forest in the west of Ireland. Seeking shelter, she becomes trapped alongside three strangers who are stalked by mysterious creatures every night",
    "type": "series"
  },
  {
    "id": 95,
    "title": "The Wire",
    "year": 2002,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/The Wire-thumbnail.jpg",
    "poster": "/covers/posters/The Wire-poster.jpg",
    "description": "The Wire is an American crime drama television series created and primarily written by American author and former police reporter David Simon for the cable network HBO. The series premiered on June 2, 2002, and ended on March 9, 2008, comprising 60 episodes over five seasons. The idea for the show started out as a police drama loosely based on the experiences of Simon's writing partner Ed Burns, a former homicide detective and public school teacher",
    "type": "series"
  },
  {
    "id": 96,
    "title": "Time Bandits",
    "year": 2024,
    "genre": "Si-Fi",
    "thumbnail": "/covers/thumbnails/Time Bandits-thumbnail.jpg",
    "poster": "/covers/posters/Time Bandits-poster.jpg",
    "description": "Time Bandits is a fantasy adventure television series created by Jemaine Clement, Iain Morris, and Taika Waititi, based on characters from the 1981 film of the same name directed by Terry Gilliam. The series premiered on July 24, 2024, on Apple TV+. In September 2024, the series was canceled after one season.",
    "type": "series"
  },
  {
    "id": 97,
    "title": "Vikings: Valhalla",
    "year": 2022,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/Vikings Valhalla-thumbnail.jpg",
    "poster": "/covers/posters/Vikings Valhalla-poster.jpg",
    "description": "Vikings: Valhalla, or simply Valhalla, is a historical drama television series created by Jeb Stuart for Netflix that serves as a sequel to Vikings. The eight-episode first season premiered on February 25, 2022. With a 24-episode order announced in November 2019, the series was renewed for a second and third season in March 2022. The second season premiered on January 12, 2023. The third and final season premiered on July 11, 2024",
    "type": "series"
  },
  {
    "id": 98,
    "title": "Vikings",
    "year": 2013,
    "genre": "Drama",
    "thumbnail": "/covers/thumbnails/Vikings-thumbnail.jpg",
    "poster": "/covers/posters/Vikings-poster.jpg",
    "description": "Vikings is a historical drama television series created and written by Michael Hirst. A co-production between Canada and Ireland, the series originally premiered on the History Channel on March 3, 2013. The series concluded with its broadcast on History in Canada from January 1 to March 3, 2021, after the second half of the sixth season was released in its entirety on Amazon Prime Video in Ireland on December 30, 2020. A sequel series, titled Vikings: Valhalla, premiered on Netflix on February 25, 2022",
    "type": "series"
  },
  {
    "id": 99,
    "title": "Warrior Nun",
    "year": 2020,
    "genre": "Action",
    "thumbnail": "/covers/thumbnails/Warrior Nun-thumbnail.jpg",
    "poster": "/covers/posters/Warrior Nun-poster.jpg",
    "description": "Warrior Nun is an American fantasy drama television series created by Simon Barry based on the comic book character Warrior Nun Areala by Ben Dunn. Developed as a feature film adaptation, the idea was re-imagined as a television series for Netflix when the service had given the production a series order for a first season. Filming takes place in multiple locations in Andalusia, Spain, such as Antequera, where the headquarters of the fictional Order of the Cruciform Sword was filmed",
    "type": "series"
  },
  {
    "id": 100,
    "title": "Wednesday",
    "year": 2022,
    "genre": "Horror",
    "thumbnail": "/covers/thumbnails/Wednesday-thumbnail.jpg",
    "poster": "/covers/posters/Wednesday-poster.jpg",
    "description": "Wednesday is an American supernatural mystery comedy[3] television series based on the character Wednesday Addams by Charles Addams. Created by Alfred Gough and Miles Millar, it stars Jenna Ortega as the titular character, with Luis Guzmán and Catherine Zeta-Jones portraying her parents in the series. Four out of the eight episodes of the first season were directed by Tim Burton, who also was executive producer. The first season revolves around Wednesday Addams, who attempts to solve a murder mystery at her new school",
    "type": "series"
  }
]
